Revit 2027 API
ParameterTypeId.MassDataGlazingIsShaded Property
 "Glazing is Shaded"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MassDataGlazingIsShaded { get; }
Public Shared ReadOnly Property MassDataGlazingIsShaded As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MassDataGlazingIsShaded {
	ForgeTypeId^ get ();
}
static member MassDataGlazingIsShaded : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace